Revit 2024 API
View.AnalysisDisplayStyleId Property
 Element id of Analysis Display Style associated with the view.
Namespace: Autodesk.Revit.DB
Assembly: RevitAPI (in RevitAPI.dll) Version: 24.0.0.0 (24.0.0.0)
Since: 2011
Syntax
C#
public ElementId AnalysisDisplayStyleId { get; set; }
Visual Basic
Public Property AnalysisDisplayStyleId As ElementId
	Get
	Set
Visual C++
public:
property ElementId^ AnalysisDisplayStyleId {
	ElementId^ get ();
	void set (ElementId^ value);
}
Exceptions
Exception | Condition
Autodesk.Revit.Exceptions.ArgumentNullException |  When setting this property: A non-optional argument was null
Autodesk.Revit.Exceptions.InvalidOperationException |  When setting this property: Cannot set the AnalysisDisplayStyleId for the specified view.
See Also
View Class
Autodesk.Revit.DB Namespace